src/bsl/InformationRegisters/гкс_СегментацияКачестваНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СегментацияКачестваНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СлужебнаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СегментацияКачестваНоменклатуры/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает список служебной номенклатуры из сегментации качества
// по переданной номенклатуре
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - номенклатура для поиска сегментов
//
// Возвращаемое значение:
//  Массив - массив элементов СправочникСсылка.Номенклатура (служебная номенклатура)
//
Функция ПолучитьСлужебнуюНоменклатуруПоСегментации(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				|	СегментацияКачества.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура
				|ИЗ
				|	РегистрСведений.гкс_СегментацияКачестваНоменклатуры КАК СегментацияКачества
				|ГДЕ
				|	СегментацияКачества.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Результат = Новый Массив;
	Иначе
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("СлужебнаяНоменклатура");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
